In [1]:
import pandas as pd

In [7]:
s1=pd.Series(['A','B','C'])

In [9]:
s1

0    A
1    B
2    C
dtype: object

In [10]:
s2=pd.Series(['D','E','F'])

In [11]:
s2

0    D
1    E
2    F
dtype: object

In [12]:
s1=pd.Series(['A','B','C'],index=[1,2,3])

In [13]:
s2=pd.Series(['D','E','F'],index=[4,5,6])

In [14]:
s1

1    A
2    B
3    C
dtype: object

In [15]:
s2

4    D
5    E
6    F
dtype: object

In [16]:
#concat function

pd.concat([s1,s2])

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

In [18]:
# lets create for dataframe

In [32]:
df1={ "Name": ["Braund, Mr. Owen Harris","Allen, Mr. William Henry","Bonnell, Miss. Elizabeth"],
 "Age": [22, 35, 58],
 "Gender": ["male", "male", "female"]
}

In [33]:
df1=pd.DataFrame(df1,index=[1,2,3])

In [34]:
df1

                       Name  Age  Gender
1   Braund, Mr. Owen Harris   22    male
2  Allen, Mr. William Henry   35    male
3  Bonnell, Miss. Elizabeth   58  female

In [35]:
df2={ "Name": ["Ravi","Mr Henry","Elizabeth"],
 "Age": [24, 31, 68],
 "Gender": ["male", "male", "female"]
}

In [36]:
df2=pd.DataFrame(df2,index=[4,5,6])

In [37]:
df2

        Name  Age  Gender
4       Ravi   24    male
5   Mr Henry   31    male
6  Elizabeth   68  female

In [38]:
# lets concate dataframe

pd.concat([df1,df2])

                       Name  Age  Gender
1   Braund, Mr. Owen Harris   22    male
2  Allen, Mr. William Henry   35    male
3  Bonnell, Miss. Elizabeth   58  female
4                      Ravi   24    male
5                  Mr Henry   31    male
6                 Elizabeth   68  female

In [40]:
# its default behavior is to concateneate row wise within the dataframe (axis=0)
# now lets concat using coloums
pd.concat([df1,df2],axis=1)

                       Name   Age  Gender       Name   Age  Gender
1   Braund, Mr. Owen Harris  22.0    male        NaN   NaN     NaN
2  Allen, Mr. William Henry  35.0    male        NaN   NaN     NaN
3  Bonnell, Miss. Elizabeth  58.0  female        NaN   NaN     NaN
4                       NaN   NaN     NaN       Ravi  24.0    male
5                       NaN   NaN     NaN   Mr Henry  31.0    male
6                       NaN   NaN     NaN  Elizabeth  68.0  female

In [41]:
import pandas as pd

df1 = pd.DataFrame({'id': ['A01', 'A02', 'A03', 'A04'],
					'Name': ['ABC', 'PQR', 'DEF', 'GHI']})

df3 = pd.DataFrame({'City': ['MUMBAI', 'PUNE', 'MUMBAI', 'DELHI'],
					'Age': ['12', '13', '14', '12']})

# the default behaviour is join='outer'
# inner join

result = pd.concat([df1, df3], axis=1)
# axis='columns'

In [42]:
result

    id Name    City Age
0  A01  ABC  MUMBAI  12
1  A02  PQR    PUNE  13
2  A03  DEF  MUMBAI  14
3  A04  GHI   DELHI  12

In [43]:
# Duplicate Indices

In [44]:
df1 = pd.DataFrame({'id': ['A01', 'A02', 'A03', 'A04'],
					'Name': ['ABC', 'PQR', 'DEF', 'GHI']})

In [45]:
df2 = pd.DataFrame({'id': ['A01', 'A02', 'A03', 'A04'],
					'Name': ['ABC', 'PQR', 'DEF', 'GHI']})

In [46]:
df1

    id Name
0  A01  ABC
1  A02  PQR
2  A03  DEF
3  A04  GHI

In [47]:
df2

    id Name
0  A01  ABC
1  A02  PQR
2  A03  DEF
3  A04  GHI

In [49]:
pd.concat([df1,df2])

    id Name
0  A01  ABC
1  A02  PQR
2  A03  DEF
3  A04  GHI
0  A01  ABC
1  A02  PQR
2  A03  DEF
3  A04  GHI

In [ ]:
#Treating repeated indices as an error

In [51]:
# pd.concat([df1,df2],verify_integrity=True)

In [52]:
# ignore the index

In [53]:
pd.concat([df1,df2])

    id Name
0  A01  ABC
1  A02  PQR
2  A03  DEF
3  A04  GHI
0  A01  ABC
1  A02  PQR
2  A03  DEF
3  A04  GHI

In [55]:
pd.concat([df1,df2],ignore_index=True)
# concatenation will create a new integer index for resulting dataframe

    id Name
0  A01  ABC
1  A02  PQR
2  A03  DEF
3  A04  GHI
4  A01  ABC
5  A02  PQR
6  A03  DEF
7  A04  GHI

In [ ]:
# adding multiindex keys

In [56]:
pd.concat([df1,df2], keys=['x','y'])

      id Name
x 0  A01  ABC
  1  A02  PQR
  2  A03  DEF
  3  A04  GHI
y 0  A01  ABC
  1  A02  PQR
  2  A03  DEF
  3  A04  GHI

In [57]:
# concatenation with joins

In [68]:
import pandas as pd
# First DataFrame
df1 = pd.DataFrame({'id': ['A01', 'A02', 'A03', 'A04'],
					'Name': ['ABC', 'PQR', 'DEF', 'GHI']})

# Second DataFrame
df2 = pd.DataFrame({'id': ['B05', 'B06', 'B07', 'B08'],
					'Name': ['XYZ', 'TUV', 'MNO', 'JKL']})

In [69]:
pd.concat([df1,df2], join='inner')

    id Name
0  A01  ABC
1  A02  PQR
2  A03  DEF
3  A04  GHI
0  B05  XYZ
1  B06  TUV
2  B07  MNO
3  B08  JKL

In [70]:
pd.concat([df1,df2], join='outer')

    id Name
0  A01  ABC
1  A02  PQR
2  A03  DEF
3  A04  GHI
0  B05  XYZ
1  B06  TUV
2  B07  MNO
3  B08  JKL

In [2]:
import pandas as pd

# Sample dataset
data = {
    'Name': ['John Doe', 'Jane Doe', 'Mary Johnson', 'Mike Brown', 'Lisa Smith'],
    'Age': [28, 34, 45, 23, 38],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix'],
    'Occupation': ['Software Engineer', 'Data Scientist', 'Doctor', 'Lawyer', 'Architect']
}

# Create a DataFrame
df = pd.DataFrame(data)

df

           Name  Age         City         Occupation
0      John Doe   28     New York  Software Engineer
1      Jane Doe   34  Los Angeles     Data Scientist
2  Mary Johnson   45      Chicago             Doctor
3    Mike Brown   23      Houston             Lawyer
4    Lisa Smith   38      Phoenix          Architect

In [3]:
# simple concatenation with pd.concat

In [5]:
# Additional DataFrame and Series for concatenation examples
df2 = pd.DataFrame({
    'City': ['Seattle', 'Denver', 'Atlanta', 'Boston', 'Austin'],
    'Occupation': ['Engineer', 'Teacher', 'Nurse', 'Chef', 'Pilot']
})

email_series = pd.Series(['john.doe@example.com', 'jane.doe@example.com', 'mary.j@example.com', 'mike.b@example.com', 'lisa.s@example.com'], name='Email')

# Concatenation examples
# 1. Concatenating DataFrames vertically
vertical_concat = pd.concat([df, df2], axis=0, ignore_index=True)

# 2. Concatenating DataFrames horizontally
horizontal_concat = pd.concat([df, df2], axis=1)

# 3. Concatenating a DataFrame and a Series horizontally
df_with_email = pd.concat([df, email_series], axis=1)

#(vertical_concat, horizontal_concat, df_with_email)

In [6]:
df_with_email

           Name  Age         City         Occupation                 Email
0      John Doe   28     New York  Software Engineer  john.doe@example.com
1      Jane Doe   34  Los Angeles     Data Scientist  jane.doe@example.com
2  Mary Johnson   45      Chicago             Doctor    mary.j@example.com
3    Mike Brown   23      Houston             Lawyer    mike.b@example.com
4    Lisa Smith   38      Phoenix          Architect    lisa.s@example.com

# Append method

In [71]:
# Re-importing pandas after code execution state reset
import pandas as pd

# Re-creating the initial DataFrame
books_df = pd.DataFrame({
    'Title': ['To Kill a Mockingbird', '1984', 'The Great Gatsby'],
    'Author': ['Harper Lee', 'George Orwell', 'F. Scott Fitzgerald']
})

# New data to append (as dictionaries)
new_book_1 = {'Title': 'The Catcher in the Rye', 'Author': 'J.D. Salinger'}
new_book_2 = {'Title': 'The Hobbit', 'Author': 'J.R.R. Tolkien'}

# Append new data to the DataFrame
updated_books_df = books_df.append([new_book_1, new_book_2], ignore_index=True)

updated_books_df

C:\Users\imran\AppData\Local\Temp\ipykernel_29844\2438704721.py:15: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  updated_books_df = books_df.append([new_book_1, new_book_2], ignore_index=True)

                    Title               Author
0   To Kill a Mockingbird           Harper Lee
1                    1984        George Orwell
2        The Great Gatsby  F. Scott Fitzgerald
3  The Catcher in the Rye        J.D. Salinger
4              The Hobbit       J.R.R. Tolkien

concat:

1. General Purpose: concat is more flexible and powerful, designed for concatenating two or more Pandas objects along a particular axis (rows or columns).

2. Multiple Objects: Can concatenate a list of DataFrames or Series at once.

3. Axes: Allows concatenation along either the row axis (axis=0) or the column axis (axis=1).

4. Options: Provides more options, such as handling index values (e.g., ignore_index, keys to create a hierarchical index), managing the concatenation of columns that don't align (join parameter to perform inner or outer joins), and handling other aspects of the concatenation operation.

5. Syntax: Typically requires a list of objects to be concatenated. For example, pd.concat([df1, df2], axis=0).

append:

1. Simpler Use Case: append is a simpler, more specific function designed primarily for adding rows to a DataFrame.

2. Single or Multiple Rows: Can append a single row (as a Series or dict) or multiple rows (as another DataFrame) to an existing DataFrame.

3. Limited to Rows: Essentially a shortcut for concat along the row axis (axis=0), without the ability to concatenate along columns.

4. Fewer Options: Offers fewer options compared to concat, mainly focusing on whether to ignore the index (ignore_index=True) and a basic form of outer join.

5. Syntax: Used as a method on a DataFrame or Series object. For example, df1.append(df2).

Summary:

1. Use concat when you need flexibility, such as concatenating along a specific axis, concatenating multiple objects at once, or managing how indexes are handled.

2. Use append for the simpler task of adding rows to a DataFrame, especially when the operation is straightforward and does not require the additional options provided by concat.